Revit 2027 API
ElectricalDemandFactorValue Constructor
 Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalDemandFactorValue()
Public Sub New
public:
ElectricalDemandFactorValue()
new : unit -> ElectricalDemandFactorValue
See Also
Reference
ElectricalDemandFactorValue Class
ElectricalDemandFactorValue Overload
Autodesk.Revit.DB.Electrical Namespace